/* XMSG: Placeholder text in chart when there is no data */
"No Data" = "ไม่มีข้อมูล";

/* XBUT: Save action in inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Save" = "เก็บบันทึก";

/* XBUT: Re-enter action available in saved state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Re-enter Signature" = "ป้อนลายเซ็นอีกครั้ง";

/* XBUT: Clear action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Clear" = "ล้าง";

/* XBUT: Cancel action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Cancel" = "ยกเลิก";

/* XTIT: Title of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Signature" = "ลายเซ็น";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Tap to Sign" = "แตะเพื่อลงลายเซ็น";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Canceled" = "ถูกยกเลิก";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Next" = "ถัดไป";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Ok" = "ตกลง";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Status" = "สถานะ";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"User canceled Onboarding" = "การจัดเตรียมระบบถูกยกเลิกโดยผู้ใช้";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Without consent you will not be able to continue onboarding." = "หากไม่มีความยินยอม คุณจะไม่สามารถดำเนินการจัดเตรียมระบบต่อได้";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Give Consent" = "ให้ความยินยอม";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Quit" = "ออก";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Back" = "ย้อนกลับ";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Step" = "ขั้นตอน";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"of" = "จาก";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Are you sure you want to quit the onboarding process?" = "คุณแน่ใจหรือไม่ว่าต้องการออกจากกระบวนการจัดเตรียมระบบ?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Want Data Privacy?" = "ต้องการการคุ้มครองข้อมูลส่วนบุคคลหรือไม่?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Be wise about your data" = "ระมัดระวังข้อมูลของคุณ";

/* XBUT: Not Now action title in UserConsentForm */
"Not Now" = "ภายหลัง";

/* XBUT: Allow action title in UserConsentForm */
"Allow" = "อนุญาต";

/* XBUT: Deny action title in UserConsentForm */
"Deny" = "ปฏิเสธ";

/* XBUT: Agree action title in EULAView */
"Agree" = "ยอมรับ";

/* XBUT: Disagree action title in EULAView */
"Disagree" = "ไม่ยอมรับ";

/* XMSG: Placeholder text in DataTable for loading state */
"Loading..." = "กำลังโหลด...";

/* XMSG: Placeholder text in DataTable when there is no data */
"There is nothing to display yet" = "ยังไม่มีอะไรที่จะแสดง";

/* XBUT: Default duration foramtter in DataTable */
"%d Hrs %d Min" = "%d ชั่วโมง %d นาที";

/* XBUT: Done action in keyboard toolbar for a Textfield in DataTable */
"Done" = "เสร็จสิ้น";

/* XBUT: Error messages shown to users in DataTable */
"There are %d errors in the data table." = "มีข้อผิดพลาด %d รายการในตารางข้อมูล";

